{
  "directed": true,
  "multigraph": false,
  "graph": {},
  "nodes": [
    {
      "Description": "<b>CAPEC-575: Account Footprinting</b><br>An adversary exploits functionality meant to identify information about the domain accounts and their permissions on the target system to an authorized user. By knowing what accounts are registered on the target system, the adversary can inform further and more targeted malicious behavior. Example Windows commands which can acquire this information are: \"net user\" and \"dsquery\".",
      "color": "#75aaff",
      "size": 18,
      "label": "Account Footprinting",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/575.html",
      "id": "CAPEC-575"
    },
    {
      "Description": "<b>CAPEC-287: TCP SYN Scan</b><br>An adversary uses a SYN scan to determine the status of ports on the remote target. SYN scanning is the most common type of port scanning that is used because of its many advantages and few drawbacks. As a result, novice attackers tend to overly rely on the SYN scan while performing system reconnaissance. As a scanning method, the primary advantages of SYN scanning are its universality and speed.",
      "color": "#94ebff",
      "size": 10,
      "label": "TCP SYN Scan",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/287.html",
      "id": "CAPEC-287"
    },
    {
      "Description": "<b>CAPEC-298: UDP Ping</b><br>An adversary sends a UDP datagram to the remote host to determine if the host is alive. If a UDP datagram is sent to an open UDP port there is very often no response, so a typical strategy for using a UDP ping is to send the datagram to a random high port on the target. The goal is to solicit an 'ICMP port unreachable' message from the target, indicating that the host is alive. UDP pings are useful because some firewalls are not configured to block UDP datagrams sent to strange or typically unused ports, like ports in the 65K range. Additionally, while some firewalls may filter incoming ICMP, weaknesses in firewall rule-sets may allow certain types of ICMP (host unreachable, port unreachable) which are useful for UDP ping attempts.",
      "color": "#94ebff",
      "size": 10,
      "label": "UDP Ping",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/298.html",
      "id": "CAPEC-298"
    },
    {
      "Description": "<b>CAPEC-301: TCP Connect Scan</b><br>An adversary uses full TCP connection attempts to determine if a port is open on the target system. The scanning process involves completing a 'three-way handshake' with a remote port, and reports the port as closed if the full handshake cannot be established. An advantage of TCP connect scanning is that it works against any TCP/IP stack.",
      "color": "#94ebff",
      "size": 10,
      "label": "TCP Connect Scan",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/301.html",
      "id": "CAPEC-301"
    },
    {
      "Description": "<b>CAPEC-149: Explore for Predictable Temporary File Names</b><br>An attacker explores a target to identify the names and locations of predictable temporary files for the purpose of launching further attacks against the target. This involves analyzing naming conventions and storage locations of the temporary files created by a target application. If an attacker can predict the names of temporary files they can use this information to mount other attacks, such as information gathering and symlink attacks.",
      "color": "#94ebff",
      "size": 10,
      "label": "Explore for Predictable Temporary File Names",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/149.html",
      "id": "CAPEC-149"
    },
    {
      "Description": "<b>CAPEC-300: Port Scanning</b><br>An adversary uses a combination of techniques to determine the state of the ports on a remote target. Any service or application available for TCP or UDP networking will have a port open for communications over the network.",
      "color": "#75aaff",
      "size": 18,
      "label": "Port Scanning",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/300.html",
      "id": "CAPEC-300"
    },
    {
      "Description": "<b>CAPEC-296: ICMP Information Request</b><br>An adversary sends an ICMP Information Request to a host to determine if it will respond to this deprecated mechanism. ICMP Information Requests are a deprecated message type. Information Requests were originally used for diskless machines to automatically obtain their network configuration, but this message type has been superseded by more robust protocol implementations like DHCP.",
      "color": "#94ebff",
      "size": 10,
      "label": "ICMP Information Request",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/296.html",
      "id": "CAPEC-296"
    },
    {
      "Description": "<b>CAPEC-497: File Discovery</b><br>An adversary engages in probing and exploration activities to determine if common key files exists. Such files often contain configuration and security parameters of the targeted application, system or network. Using this knowledge may often pave the way for more damaging attacks.",
      "color": "#75aaff",
      "size": 18,
      "label": "File Discovery",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/497.html",
      "id": "CAPEC-497"
    },
    {
      "Description": "<b>CAPEC-307: TCP RPC Scan</b><br>An adversary scans for RPC services listing on a Unix/Linux host.",
      "color": "#94ebff",
      "size": 10,
      "label": "TCP RPC Scan",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/307.html",
      "id": "CAPEC-307"
    },
    {
      "Description": "<b>CAPEC-576: Group Permission Footprinting</b><br>An adversary exploits functionality meant to identify information about user groups and their permissions on the target system to an authorized user. By knowing what users/permissions are registered on the target system, the adversary can inform further and more targeted malicious behavior. An example Windows command which can list local groups is \"net localgroup\".",
      "color": "#75aaff",
      "size": 18,
      "label": "Group Permission Footprinting",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/576.html",
      "id": "CAPEC-576"
    },
    {
      "Description": "<b>CAPEC-292: Host Discovery</b><br>An adversary sends a probe to an IP address to determine if the host is alive. Host discovery is one of the earliest phases of network reconnaissance. The adversary usually starts with a range of IP addresses belonging to a target network and uses various methods to determine if a host is present at that IP address. Host discovery is usually referred to as 'Ping' scanning using a sonar analogy. The goal is to send a packet through to the IP address and solicit a response from the host. As such, a 'ping' can be virtually any crafted packet whatsoever, provided the adversary can identify a functional host based on its response. An attack of this nature is usually carried out with a 'ping sweep,' where a particular kind of ping is sent to a range of IP addresses.",
      "color": "#75aaff",
      "size": 18,
      "label": "Host Discovery",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/292.html",
      "id": "CAPEC-292"
    },
    {
      "Description": "<b>CAPEC-169: Footprinting</b><br>An adversary engages in probing and exploration activities to identify constituents and properties of the target.",
      "color": "#2176ff",
      "size": 30,
      "label": "Footprinting",
      "label_class": "node-label-big",
      "type": "CAPEC",
      "abstraction": "Meta",
      "url": "https://capec.mitre.org/data/definitions/169.html",
      "id": "CAPEC-169"
    },
    {
      "Description": "<b>CAPEC-694: System Location Discovery</b><br>An adversary collects information about the target system in an attempt to identify the system's geographical location. \n Information gathered could include keyboard layout, system language, and timezone. This information may benefit an adversary in confirming the desired target and/or tailoring further attacks.",
      "color": "#75aaff",
      "size": 18,
      "label": "System Location Discovery",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/694.html",
      "id": "CAPEC-694"
    },
    {
      "Description": "<b>CAPEC-290: Enumerate Mail Exchange (MX) Records</b><br>An adversary enumerates the MX records for a given via a DNS query. This type of information gathering returns the names of mail servers on the network. Mail servers are often not exposed to the Internet but are located within the DMZ of a network protected by a firewall. A side effect of this configuration is that enumerating the MX records for an organization my reveal the IP address of the firewall or possibly other internal systems. Attackers often resort to MX record enumeration when a DNS Zone Transfer is not possible.",
      "color": "#94ebff",
      "size": 10,
      "label": "Enumerate Mail Exchange (MX) Records",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/290.html",
      "id": "CAPEC-290"
    },
    {
      "Description": "<b>CAPEC-618: Cellular Broadcast Message Request</b><br>In this attack scenario, the attacker uses knowledge of the target’s mobile phone number (i.e., the number associated with the SIM used in the retransmission device) to cause the cellular network to send broadcast messages to alert the mobile device. Since the network knows which cell tower the target’s mobile device is attached to, the broadcast messages are only sent in the Location Area Code (LAC) where the target is currently located. By triggering the cellular broadcast message and then listening for the presence or absence of that message, an attacker could verify that the target is in (or not in) a given location.",
      "color": "#94ebff",
      "size": 10,
      "label": "Cellular Broadcast Message Request",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/618.html",
      "id": "CAPEC-618"
    },
    {
      "Description": "<b>CAPEC-304: TCP Null Scan</b><br>An adversary uses a TCP NULL scan to determine if ports are closed on the target machine. This scan type is accomplished by sending TCP segments with no flags in the packet header, generating packets that are illegal based on RFC 793. The RFC 793 expected behavior is that any TCP segment with an out-of-state Flag sent to an open port is discarded, whereas segments with out-of-state flags sent to closed ports should be handled with a RST in response. This behavior should allow an attacker to scan for closed ports by sending certain types of rule-breaking packets (out of sync or disallowed by the TCB) and detect closed ports via RST packets.",
      "color": "#94ebff",
      "size": 10,
      "label": "TCP Null Scan",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/304.html",
      "id": "CAPEC-304"
    },
    {
      "Description": "<b>CAPEC-306: TCP Window Scan</b><br>An adversary engages in TCP Window scanning to analyze port status and operating system type. TCP Window scanning uses the ACK scanning method but examine the TCP Window Size field of response RST packets to make certain inferences. While TCP Window Scans are fast and relatively stealthy, they work against fewer TCP stack implementations than any other type of scan. Some operating systems return a positive TCP window size when a RST packet is sent from an open port, and a negative value when the RST originates from a closed port. TCP Window scanning is one of the most complex scan types, and its results are difficult to interpret. Window scanning alone rarely yields useful information, but when combined with other types of scanning is more useful. It is a generally more reliable means of making inference about operating system versions than port status.",
      "color": "#94ebff",
      "size": 10,
      "label": "TCP Window Scan",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/306.html",
      "id": "CAPEC-306"
    },
    {
      "Description": "<b>CAPEC-297: TCP ACK Ping</b><br>An adversary sends a TCP segment with the ACK flag set to a remote host for the purpose of determining if the host is alive. This is one of several TCP 'ping' types. The RFC 793 expected behavior for a service is to respond with a RST 'reset' packet to any unsolicited ACK segment that is not part of an existing connection. So by sending an ACK segment to a port, the adversary can identify that the host is alive by looking for a RST packet. Typically, a remote server will respond with a RST regardless of whether a port is open or closed. In this way, TCP ACK pings cannot discover the state of a remote port because the behavior is the same in either case. The firewall will look up the ACK packet in its state-table and discard the segment because it does not correspond to any active connection. A TCP ACK Ping can be used to discover if a host is alive via RST response packets sent from the host.",
      "color": "#94ebff",
      "size": 10,
      "label": "TCP ACK Ping",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/297.html",
      "id": "CAPEC-297"
    },
    {
      "Description": "<b>CAPEC-305: TCP ACK Scan</b><br>An adversary uses TCP ACK segments to gather information about firewall or ACL configuration. The purpose of this type of scan is to discover information about filter configurations rather than port state. This type of scanning is rarely useful alone, but when combined with SYN scanning, gives a more complete picture of the type of firewall rules that are present.",
      "color": "#94ebff",
      "size": 10,
      "label": "TCP ACK Scan",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/305.html",
      "id": "CAPEC-305"
    },
    {
      "Description": "<b>CAPEC-612: WiFi MAC Address Tracking</b><br>In this attack scenario, the attacker passively listens for WiFi messages and logs the associated Media Access Control (MAC) addresses. These addresses are intended to be unique to each wireless device (although they can be configured and changed by software). Once the attacker is able to associate a MAC address with a particular user or set of users (for example, when attending a public event), the attacker can then scan for that MAC address to track that user in the future.",
      "color": "#94ebff",
      "size": 10,
      "label": "WiFi MAC Address Tracking",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/612.html",
      "id": "CAPEC-612"
    },
    {
      "Description": "<b>CAPEC-309: Network Topology Mapping</b><br>An adversary engages in scanning activities to map network nodes, hosts, devices, and routes. Adversaries usually perform this type of network reconnaissance during the early stages of attack against an external network. Many types of scanning utilities are typically employed, including ICMP tools, network mappers, port scanners, and route testing utilities such as traceroute.",
      "color": "#75aaff",
      "size": 18,
      "label": "Network Topology Mapping",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/309.html",
      "id": "CAPEC-309"
    },
    {
      "Description": "<b>CAPEC-646: Peripheral Footprinting</b><br>Adversaries may attempt to obtain information about attached peripheral devices and components connected to a computer system. Examples may include discovering the presence of iOS devices by searching for backups, analyzing the Windows registry to determine what USB devices have been connected, or infecting a victim system with malware to report when a USB device has been connected. This may allow the adversary to gain additional insight about the system or network environment, which may be useful in constructing further attacks.",
      "color": "#75aaff",
      "size": 18,
      "label": "Peripheral Footprinting",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/646.html",
      "id": "CAPEC-646"
    },
    {
      "Description": "<b>CAPEC-577: Owner Footprinting</b><br>An adversary exploits functionality meant to identify information about the primary users on the target system to an authorized user. They may do this, for example, by reviewing logins or file modification times. By knowing what owners use the target system, the adversary can inform further and more targeted malicious behavior. An example Windows command that may accomplish this is \"dir /A ntuser.dat\". Which will display the last modified time of a user's ntuser.dat file when run within the root folder of a user. This time is synonymous with the last time that user was logged in.",
      "color": "#75aaff",
      "size": 18,
      "label": "Owner Footprinting",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/577.html",
      "id": "CAPEC-577"
    },
    {
      "Description": "<b>CAPEC-85: AJAX Footprinting</b><br>This attack utilizes the frequent client-server roundtrips in Ajax conversation to scan a system. While Ajax does not open up new vulnerabilities per se, it does optimize them from an attacker point of view. A common first step for an attacker is to footprint the target environment to understand what attacks will work. Since footprinting relies on enumeration, the conversational pattern of rapid, multiple requests and responses that are typical in Ajax applications enable an attacker to look for many vulnerabilities, well-known ports, network locations and so on. The knowledge gained through Ajax fingerprinting can be used to support other attacks, such as XSS.",
      "color": "#94ebff",
      "size": 10,
      "label": "AJAX Footprinting",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/85.html",
      "id": "CAPEC-85"
    },
    {
      "Description": "<b>CAPEC-303: TCP Xmas Scan</b><br>An adversary uses a TCP XMAS scan to determine if ports are closed on the target machine. This scan type is accomplished by sending TCP segments with all possible flags set in the packet header, generating packets that are illegal based on RFC 793. The RFC 793 expected behavior is that any TCP segment with an out-of-state Flag sent to an open port is discarded, whereas segments with out-of-state flags sent to closed ports should be handled with a RST in response. This behavior should allow an attacker to scan for closed ports by sending certain types of rule-breaking packets (out of sync or disallowed by the TCB) and detect closed ports via RST packets.",
      "color": "#94ebff",
      "size": 10,
      "label": "TCP Xmas Scan",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/303.html",
      "id": "CAPEC-303"
    },
    {
      "Description": "<b>CAPEC-295: Timestamp Request</b><br>This pattern of attack leverages standard requests to learn the exact time associated with a target system. An adversary may be able to use the timestamp returned from the target to attack time-based security algorithms, such as random number generators, or time-based authentication mechanisms.",
      "color": "#94ebff",
      "size": 10,
      "label": "Timestamp Request",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/295.html",
      "id": "CAPEC-295"
    },
    {
      "Description": "<b>CAPEC-581: Security Software Footprinting</b><br>Adversaries may attempt to get a listing of security tools that are installed on the system and their configurations. This may include security related system features (such as a built-in firewall or anti-spyware) as well as third-party security software.",
      "color": "#94ebff",
      "size": 10,
      "label": "Security Software Footprinting",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/581.html",
      "id": "CAPEC-581"
    },
    {
      "Description": "<b>CAPEC-291: DNS Zone Transfers</b><br>An attacker exploits a DNS misconfiguration that permits a ZONE transfer. Some external DNS servers will return a list of IP address and valid hostnames. Under certain conditions, it may even be possible to obtain Zone data about the organization's internal network. When successful the attacker learns valuable information about the topology of the target organization, including information about particular servers, their role within the IT structure, and possibly information about the operating systems running upon the network. This is configuration dependent behavior so it may also be required to search out multiple DNS servers while attempting to find one with ZONE transfers allowed.",
      "color": "#94ebff",
      "size": 10,
      "label": "DNS Zone Transfers",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/291.html",
      "id": "CAPEC-291"
    },
    {
      "Description": "<b>CAPEC-580: System Footprinting</b><br>An adversary engages in active probing and exploration activities to determine security information about a remote target system. Often times adversaries will rely on remote applications that can be probed for system configurations.",
      "color": "#75aaff",
      "size": 18,
      "label": "System Footprinting",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/580.html",
      "id": "CAPEC-580"
    },
    {
      "Description": "<b>CAPEC-529: Malware-Directed Internal Reconnaissance</b><br>Adversary uses malware or a similarly controlled application installed inside an organizational perimeter to gather information about the composition, configuration, and security mechanisms of a targeted application, system or network.",
      "color": "#75aaff",
      "size": 18,
      "label": "Malware-Directed Internal Reconnaissance",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/529.html",
      "id": "CAPEC-529"
    },
    {
      "Description": "<b>CAPEC-293: Traceroute Route Enumeration</b><br>An adversary uses a traceroute utility to map out the route which data flows through the network in route to a target destination. Tracerouting can allow the adversary to construct a working topology of systems and routers by listing the systems through which data passes through on their way to the targeted machine. This attack can return varied results depending upon the type of traceroute that is performed. Traceroute works by sending packets to a target while incrementing the Time-to-Live field in the packet header. As the packet traverses each hop along its way to the destination, its TTL expires generating an ICMP diagnostic message that identifies where the packet expired. Traditional techniques for tracerouting involved the use of ICMP and UDP, but as more firewalls began to filter ingress ICMP, methods of traceroute using TCP were developed.",
      "color": "#94ebff",
      "size": 10,
      "label": "Traceroute Route Enumeration",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/293.html",
      "id": "CAPEC-293"
    },
    {
      "Description": "<b>CAPEC-613: WiFi SSID Tracking</b><br>In this attack scenario, the attacker passively listens for WiFi management frame messages containing the Service Set Identifier (SSID) for the WiFi network. These messages are frequently transmitted by WiFi access points (e.g., the retransmission device) as well as by clients that are accessing the network (e.g., the handset/mobile device). Once the attacker is able to associate an SSID with a particular user or set of users (for example, when attending a public event), the attacker can then scan for this SSID to track that user in the future.",
      "color": "#94ebff",
      "size": 10,
      "label": "WiFi SSID Tracking",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/613.html",
      "id": "CAPEC-613"
    },
    {
      "Description": "<b>CAPEC-619: Signal Strength Tracking</b><br>In this attack scenario, the attacker passively monitors the signal strength of the target’s cellular RF signal or WiFi RF signal and uses the strength of the signal (with directional antennas and/or from multiple listening points at once) to identify the source location of the signal. Obtaining the signal of the target can be accomplished through multiple techniques such as through Cellular Broadcast Message Request or through the use of IMSI Tracking or WiFi MAC Address Tracking.",
      "color": "#94ebff",
      "size": 10,
      "label": "Signal Strength Tracking",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/619.html",
      "id": "CAPEC-619"
    },
    {
      "Description": "<b>CAPEC-573: Process Footprinting</b><br>An adversary exploits functionality meant to identify information about the currently running processes on the target system to an authorized user. By knowing what processes are running on the target system, the adversary can learn about the target environment as a means towards further malicious behavior.",
      "color": "#75aaff",
      "size": 18,
      "label": "Process Footprinting",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/573.html",
      "id": "CAPEC-573"
    },
    {
      "Description": "<b>CAPEC-643: Identify Shared Files/Directories on System</b><br>An adversary discovers connections between systems by exploiting the target system's standard practice of revealing them in searchable, common areas. Through the identification of shared folders/drives between systems, the adversary may further their goals of locating and collecting sensitive information/files, or map potential routes for lateral movement within the network.",
      "color": "#94ebff",
      "size": 10,
      "label": "Identify Shared Files/Directories on System",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/643.html",
      "id": "CAPEC-643"
    },
    {
      "Description": "<b>CAPEC-302: TCP FIN Scan</b><br>An adversary uses a TCP FIN scan to determine if ports are closed on the target machine. This scan type is accomplished by sending TCP segments with the FIN bit set in the packet header. The RFC 793 expected behavior is that any TCP segment with an out-of-state Flag sent to an open port is discarded, whereas segments with out-of-state flags sent to closed ports should be handled with a RST in response. This behavior should allow the adversary to scan for closed ports by sending certain types of rule-breaking packets (out of sync or disallowed by the TCB) and detect closed ports via RST packets.",
      "color": "#94ebff",
      "size": 10,
      "label": "TCP FIN Scan",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/302.html",
      "id": "CAPEC-302"
    },
    {
      "Description": "<b>CAPEC-299: TCP SYN Ping</b><br>An adversary uses TCP SYN packets as a means towards host discovery. Typical RFC 793 behavior specifies that when a TCP port is open, a host must respond to an incoming SYN \"synchronize\" packet by completing stage two of the 'three-way handshake' - by sending an SYN/ACK in response. When a port is closed, RFC 793 behavior is to respond with a RST \"reset\" packet. This behavior can be used to 'ping' a target to see if it is alive by sending a TCP SYN packet to a port and then looking for a RST or an ACK packet in response.",
      "color": "#94ebff",
      "size": 10,
      "label": "TCP SYN Ping",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/299.html",
      "id": "CAPEC-299"
    },
    {
      "Description": "<b>CAPEC-285: ICMP Echo Request Ping</b><br>An adversary sends out an ICMP Type 8 Echo Request, commonly known as a 'Ping', in order to determine if a target system is responsive. If the request is not blocked by a firewall or ACL, the target host will respond with an ICMP Type 0 Echo Reply datagram. This type of exchange is usually referred to as a 'Ping' due to the Ping utility present in almost all operating systems. Ping, as commonly implemented, allows a user to test for alive hosts, measure round-trip time, and measure the percentage of packet loss.",
      "color": "#94ebff",
      "size": 10,
      "label": "ICMP Echo Request Ping",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/285.html",
      "id": "CAPEC-285"
    },
    {
      "Description": "<b>CAPEC-294: ICMP Address Mask Request</b><br>An adversary sends an ICMP Type 17 Address Mask Request to gather information about a target's networking configuration. ICMP Address Mask Requests are defined by RFC-950, \"Internet Standard Subnetting Procedure.\" An Address Mask Request is an ICMP type 17 message that triggers a remote system to respond with a list of its related subnets, as well as its default gateway and broadcast address via an ICMP type 18 Address Mask Reply datagram. Gathering this type of information helps the adversary plan router-based attacks as well as denial-of-service attacks against the broadcast address.",
      "color": "#94ebff",
      "size": 10,
      "label": "ICMP Address Mask Request",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/294.html",
      "id": "CAPEC-294"
    },
    {
      "Description": "<b>CAPEC-574: Services Footprinting</b><br>An adversary exploits functionality meant to identify information about the services on the target system to an authorized user. By knowing what services are registered on the target system, the adversary can learn about the target environment as a means towards further malicious behavior. Depending on the operating system, commands that can obtain services information include \"sc\" and \"tasklist/svc\" using Tasklist, and \"net start\" using Net.",
      "color": "#75aaff",
      "size": 18,
      "label": "Services Footprinting",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/574.html",
      "id": "CAPEC-574"
    },
    {
      "Description": "<b>CAPEC-308: UDP Scan</b><br>An adversary engages in UDP scanning to gather information about UDP port status on the target system. UDP scanning methods involve sending a UDP datagram to the target port and looking for evidence that the port is closed. Open UDP ports usually do not respond to UDP datagrams as there is no stateful mechanism within the protocol that requires building or establishing a session. Responses to UDP datagrams are therefore application specific and cannot be relied upon as a method of detecting an open port. UDP scanning relies heavily upon ICMP diagnostic messages in order to determine the status of a remote port.",
      "color": "#94ebff",
      "size": 10,
      "label": "UDP Scan",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/308.html",
      "id": "CAPEC-308"
    }
  ],
  "links": [
    {
      "source": "CAPEC-575",
      "target": "CAPEC-169"
    },
    {
      "source": "CAPEC-287",
      "target": "CAPEC-300"
    },
    {
      "source": "CAPEC-298",
      "target": "CAPEC-292"
    },
    {
      "source": "CAPEC-301",
      "target": "CAPEC-300"
    },
    {
      "source": "CAPEC-149",
      "target": "CAPEC-497"
    },
    {
      "source": "CAPEC-300",
      "target": "CAPEC-169"
    },
    {
      "source": "CAPEC-296",
      "target": "CAPEC-292"
    },
    {
      "source": "CAPEC-497",
      "target": "CAPEC-169"
    },
    {
      "source": "CAPEC-307",
      "target": "CAPEC-300"
    },
    {
      "source": "CAPEC-576",
      "target": "CAPEC-169"
    },
    {
      "source": "CAPEC-292",
      "target": "CAPEC-169"
    },
    {
      "source": "CAPEC-694",
      "target": "CAPEC-169"
    },
    {
      "source": "CAPEC-290",
      "target": "CAPEC-309"
    },
    {
      "source": "CAPEC-618",
      "target": "CAPEC-292"
    },
    {
      "source": "CAPEC-304",
      "target": "CAPEC-300"
    },
    {
      "source": "CAPEC-306",
      "target": "CAPEC-300"
    },
    {
      "source": "CAPEC-297",
      "target": "CAPEC-292"
    },
    {
      "source": "CAPEC-305",
      "target": "CAPEC-300"
    },
    {
      "source": "CAPEC-612",
      "target": "CAPEC-292"
    },
    {
      "source": "CAPEC-309",
      "target": "CAPEC-169"
    },
    {
      "source": "CAPEC-646",
      "target": "CAPEC-169"
    },
    {
      "source": "CAPEC-577",
      "target": "CAPEC-169"
    },
    {
      "source": "CAPEC-85",
      "target": "CAPEC-580"
    },
    {
      "source": "CAPEC-303",
      "target": "CAPEC-300"
    },
    {
      "source": "CAPEC-295",
      "target": "CAPEC-292"
    },
    {
      "source": "CAPEC-581",
      "target": "CAPEC-580"
    },
    {
      "source": "CAPEC-291",
      "target": "CAPEC-309"
    },
    {
      "source": "CAPEC-580",
      "target": "CAPEC-169"
    },
    {
      "source": "CAPEC-529",
      "target": "CAPEC-169"
    },
    {
      "source": "CAPEC-293",
      "target": "CAPEC-309"
    },
    {
      "source": "CAPEC-613",
      "target": "CAPEC-292"
    },
    {
      "source": "CAPEC-619",
      "target": "CAPEC-292"
    },
    {
      "source": "CAPEC-573",
      "target": "CAPEC-169"
    },
    {
      "source": "CAPEC-643",
      "target": "CAPEC-309"
    },
    {
      "source": "CAPEC-302",
      "target": "CAPEC-300"
    },
    {
      "source": "CAPEC-299",
      "target": "CAPEC-292"
    },
    {
      "source": "CAPEC-285",
      "target": "CAPEC-292"
    },
    {
      "source": "CAPEC-294",
      "target": "CAPEC-292"
    },
    {
      "source": "CAPEC-574",
      "target": "CAPEC-169"
    },
    {
      "source": "CAPEC-308",
      "target": "CAPEC-300"
    }
  ]
}