{
  "directed": true,
  "multigraph": false,
  "graph": {},
  "nodes": [
    {
      "Description": "<b>CAPEC-179: Calling Micro-Services Directly</b><br>An attacker is able to discover and query Micro-services at a web location and thereby expose the Micro-services to further exploitation by gathering information about their implementation and function. Micro-services in web pages allow portions of a page to connect to the server and update content without needing to cause the entire page to update. This allows user activity to change portions of the page more quickly without causing disruptions elsewhere.",
      "color": "#75aaff",
      "size": 18,
      "label": "Calling Micro-Services Directly",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/179.html",
      "id": "CAPEC-179"
    },
    {
      "Description": "<b>CAPEC-465: Transparent Proxy Abuse</b><br>A transparent proxy serves as an intermediate between the client and the internet at large. It intercepts all requests originating from the client and forwards them to the correct location. The proxy also intercepts all responses to the client and forwards these to the client. All of this is done in a manner transparent to the client.",
      "color": "#75aaff",
      "size": 18,
      "label": "Transparent Proxy Abuse",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/465.html",
      "id": "CAPEC-465"
    },
    {
      "Description": "<b>CAPEC-554: Functionality Bypass</b><br>An adversary attacks a system by bypassing some or all functionality intended to protect it. Often, a system user will think that protection is in place, but the functionality behind those protections has been disabled by the adversary.",
      "color": "#2176ff",
      "size": 30,
      "label": "Functionality Bypass",
      "label_class": "node-label-big",
      "type": "CAPEC",
      "abstraction": "Meta",
      "url": "https://capec.mitre.org/data/definitions/554.html",
      "id": "CAPEC-554"
    },
    {
      "Description": "<b>CAPEC-464: Evercookie</b><br>An attacker creates a very persistent cookie that stays present even after the user thinks it has been removed. The cookie is stored on the victim's machine in over ten places. When the victim clears the cookie cache via traditional means inside the browser, that operation removes the cookie from certain places but not others. The malicious code then replicates the cookie from all of the places where it was not deleted to all of the possible storage locations once again. So the victim again has the cookie in all of the original storage locations. In other words, failure to delete the cookie in even one location will result in the cookie's resurrection everywhere. The evercookie will also persist across different browsers because certain stores (e.g., Local Shared Objects) are shared between different browsers.",
      "color": "#75aaff",
      "size": 18,
      "label": "Evercookie",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/464.html",
      "id": "CAPEC-464"
    }
  ],
  "links": [
    {
      "source": "CAPEC-179",
      "target": "CAPEC-554"
    },
    {
      "source": "CAPEC-465",
      "target": "CAPEC-554"
    },
    {
      "source": "CAPEC-464",
      "target": "CAPEC-554"
    }
  ]
}