{
  "directed": true,
  "multigraph": false,
  "graph": {},
  "nodes": [
    {
      "Description": "<b>CAPEC-81: Web Server Logs Tampering</b><br>Web Logs Tampering attacks involve an attacker injecting, deleting or otherwise tampering with the contents of web logs typically for the purposes of masking other malicious behavior. Additionally, writing malicious data to log files may target jobs, filters, reports, and other agents that process the logs in an asynchronous attack pattern. This pattern of attack is similar to \"Log Injection-Tampering-Forging\" except that in this case, the attack is targeting the logs of the web server and not the application.",
      "color": "#94ebff",
      "size": 10,
      "label": "Web Server Logs Tampering",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/81.html",
      "id": "CAPEC-81"
    },
    {
      "Description": "<b>CAPEC-481: Contradictory Destinations in Traffic Routing Schemes</b><br>Adversaries can provide contradictory destinations when sending messages. Traffic is routed in networks using the domain names in various headers available at different levels of the OSI model. In a Content Delivery Network (CDN) multiple domains might be available, and if there are contradictory domain names provided it is possible to route traffic to an inappropriate destination. The technique, called Domain Fronting, involves using different domain names in the SNI field of the TLS header and the Host field of the HTTP header. An alternative technique, called Domainless Fronting, is similar, but the SNI field is left blank.",
      "color": "#75aaff",
      "size": 18,
      "label": "Contradictory Destinations in Traffic Routing Schemes",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/481.html",
      "id": "CAPEC-481"
    },
    {
      "Description": "<b>CAPEC-93: Log Injection-Tampering-Forging</b><br>This attack targets the log files of the target host. The attacker injects, manipulates or forges malicious log entries in the log file, allowing them to mislead a log audit, cover traces of attack, or perform other malicious actions. The target host is not properly controlling log access. As a result tainted data is resulting in the log files leading to a failure in accountability, non-repudiation and incident forensics capability.",
      "color": "#94ebff",
      "size": 10,
      "label": "Log Injection-Tampering-Forging",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/93.html",
      "id": "CAPEC-93"
    },
    {
      "Description": "<b>CAPEC-161: Infrastructure Manipulation</b><br>An attacker exploits characteristics of the infrastructure of a network entity in order to perpetrate attacks or information gathering on network objects or effect a change in the ordinary information flow between network objects. Most often, this involves manipulation of the routing of network messages so, instead of arriving at their proper destination, they are directed towards an entity of the attackers' choosing, usually a server controlled by the attacker. The victim is often unaware that their messages are not being processed correctly. For example, a targeted client may believe they are connecting to their own bank but, in fact, be connecting to a Pharming site controlled by the attacker which then collects the user's login information in order to hijack the actual bank account.",
      "color": "#2176ff",
      "size": 30,
      "label": "Infrastructure Manipulation",
      "label_class": "node-label-big",
      "type": "CAPEC",
      "abstraction": "Meta",
      "url": "https://capec.mitre.org/data/definitions/161.html",
      "id": "CAPEC-161"
    },
    {
      "Description": "<b>CAPEC-141: Cache Poisoning</b><br>An attacker exploits the functionality of cache technologies to cause specific data to be cached that aids the attackers' objectives. This describes any attack whereby an attacker places incorrect or harmful material in cache. The targeted cache can be an application's cache (e.g. a web browser cache) or a public cache (e.g. a DNS or ARP cache). Until the cache is refreshed, most applications or clients will treat the corrupted cache value as valid. This can lead to a wide range of exploits including redirecting web browsers towards sites that install malware and repeatedly incorrect calculations based on the incorrect value.",
      "color": "#75aaff",
      "size": 18,
      "label": "Cache Poisoning",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/141.html",
      "id": "CAPEC-141"
    },
    {
      "Description": "<b>CAPEC-268: Audit Log Manipulation</b><br>The attacker injects, manipulates, deletes, or forges malicious log entries into the log file, in an attempt to mislead an audit of the log file or cover tracks of an attack. Due to either insufficient access controls of the log files or the logging mechanism, the attacker is able to perform such actions.",
      "color": "#75aaff",
      "size": 18,
      "label": "Audit Log Manipulation",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/268.html",
      "id": "CAPEC-268"
    },
    {
      "Description": "<b>CAPEC-166: Force the System to Reset Values</b><br>An attacker forces the target into a previous state in order to leverage potential weaknesses in the target dependent upon a prior configuration or state-dependent factors. Even in cases where an attacker may not be able to directly control the configuration of the targeted application, they may be able to reset the configuration to a prior state since many applications implement reset functions.",
      "color": "#75aaff",
      "size": 18,
      "label": "Force the System to Reset Values",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/166.html",
      "id": "CAPEC-166"
    },
    {
      "Description": "<b>CAPEC-571: Block Logging to Central Repository</b><br>An adversary prevents host-generated logs being delivered to a central location in an attempt to hide indicators of compromise.",
      "color": "#75aaff",
      "size": 18,
      "label": "Block Logging to Central Repository",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/571.html",
      "id": "CAPEC-571"
    },
    {
      "Description": "<b>CAPEC-142: DNS Cache Poisoning</b><br>A domain name server translates a domain name (such as www.example.com) into an IP address that Internet hosts use to contact Internet resources. An adversary modifies a public DNS cache to cause certain names to resolve to incorrect addresses that the adversary specifies. The result is that client applications that rely upon the targeted cache for domain name resolution will be directed not to the actual address of the specified domain name but to some other address. Adversaries can use this to herd clients to sites that install malware on the victim's computer or to masquerade as part of a Pharming attack.",
      "color": "#94ebff",
      "size": 10,
      "label": "DNS Cache Poisoning",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/142.html",
      "id": "CAPEC-142"
    },
    {
      "Description": "<b>CAPEC-700: Network Boundary Bridging</b><br>An adversary which has gained elevated access to network boundary devices may use these devices to create a channel to bridge trusted and untrusted networks. Boundary devices do not necessarily have to be on the network’s edge, but rather must serve to segment portions of the target network the adversary wishes to cross into.",
      "color": "#75aaff",
      "size": 18,
      "label": "Network Boundary Bridging",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/700.html",
      "id": "CAPEC-700"
    }
  ],
  "links": [
    {
      "source": "CAPEC-81",
      "target": "CAPEC-268"
    },
    {
      "source": "CAPEC-481",
      "target": "CAPEC-161"
    },
    {
      "source": "CAPEC-93",
      "target": "CAPEC-268"
    },
    {
      "source": "CAPEC-141",
      "target": "CAPEC-161"
    },
    {
      "source": "CAPEC-268",
      "target": "CAPEC-161"
    },
    {
      "source": "CAPEC-166",
      "target": "CAPEC-161"
    },
    {
      "source": "CAPEC-571",
      "target": "CAPEC-161"
    },
    {
      "source": "CAPEC-142",
      "target": "CAPEC-141"
    },
    {
      "source": "CAPEC-700",
      "target": "CAPEC-161"
    }
  ]
}