{
  "directed": true,
  "multigraph": false,
  "graph": {},
  "nodes": [
    {
      "Description": "<b>CAPEC-102: Session Sidejacking</b><br>Session sidejacking takes advantage of an unencrypted communication channel between a victim and target system. The attacker sniffs traffic on a network looking for session tokens in unencrypted traffic. Once a session token is captured, the attacker performs malicious actions by using the stolen token with the targeted application to impersonate the victim. This attack is a specific method of session hijacking, which is exploiting a valid session token to gain unauthorized access to a target system or information. Other methods to perform a session hijacking are session fixation, cross-site scripting, or compromising a user or server machine and stealing the session token.",
      "color": "#94ebff",
      "size": 10,
      "label": "Session Sidejacking",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/102.html",
      "id": "CAPEC-102"
    },
    {
      "Description": "<b>CAPEC-60: Reusing Session IDs (aka Session Replay)</b><br>This attack targets the reuse of valid session ID to spoof the target system in order to gain privileges. The attacker tries to reuse a stolen session ID used previously during a transaction to perform spoofing and session hijacking. Another name for this type of attack is Session Replay.",
      "color": "#94ebff",
      "size": 10,
      "label": "Reusing Session IDs (aka Session Replay)",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/60.html",
      "id": "CAPEC-60"
    },
    {
      "Description": "<b>CAPEC-467: Cross Site Identification</b><br>An attacker harvests identifying information about a victim via an active session that the victim's browser has with a social networking site. A victim may have the social networking site open in one tab or perhaps is simply using the \"remember me\" feature to keep their session with the social networking site active. An attacker induces a payload to execute in the victim's browser that transparently to the victim initiates a request to the social networking site (e.g., via available social network site APIs) to retrieve identifying information about a victim. While some of this information may be public, the attacker is able to harvest this information in context and may use it for further attacks on the user (e.g., spear phishing).",
      "color": "#94ebff",
      "size": 10,
      "label": "Cross Site Identification",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/467.html",
      "id": "CAPEC-467"
    },
    {
      "Description": "<b>CAPEC-59: Session Credential Falsification through Prediction</b><br>This attack targets predictable session ID in order to gain privileges. The attacker can predict the session ID used during a transaction to perform spoofing and session hijacking.",
      "color": "#94ebff",
      "size": 10,
      "label": "Session Credential Falsification through Prediction",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/59.html",
      "id": "CAPEC-59"
    },
    {
      "Description": "<b>CAPEC-510: SaaS User Request Forgery</b><br>An adversary, through a previously installed malicious application, performs malicious actions against a third-party Software as a Service (SaaS) application (also known as a cloud based application) by leveraging the persistent and implicit trust placed on a trusted user's session. This attack is executed after a trusted user is authenticated into a cloud service, \"piggy-backing\" on the authenticated session, and exploiting the fact that the cloud service believes it is only interacting with the trusted user. If successful, the actions embedded in the malicious application will be processed and accepted by the targeted SaaS application and executed at the trusted user's privilege level.",
      "color": "#75aaff",
      "size": 18,
      "label": "SaaS User Request Forgery",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/510.html",
      "id": "CAPEC-510"
    },
    {
      "Description": "<b>CAPEC-62: Cross Site Request Forgery</b><br>An attacker crafts malicious web links and distributes them (via web pages, email, etc.), typically in a targeted manner, hoping to induce users to click on the link and execute the malicious action against some third-party application. If successful, the action embedded in the malicious link will be processed and accepted by the targeted application with the users' privilege level. This type of attack leverages the persistence and implicit trust placed in user session cookies by many web applications today. In such an architecture, once the user authenticates to an application and a session cookie is created on the user's system, all following transactions for that session are authenticated using that cookie including potential actions initiated by an attacker and simply \"riding\" the existing session cookie.",
      "color": "#75aaff",
      "size": 18,
      "label": "Cross Site Request Forgery",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/62.html",
      "id": "CAPEC-62"
    },
    {
      "Description": "<b>CAPEC-107: Cross Site Tracing</b><br>Cross Site Tracing (XST) enables an adversary to steal the victim's session cookie and possibly other authentication credentials transmitted in the header of the HTTP request when the victim's browser communicates to a destination system's web server.",
      "color": "#94ebff",
      "size": 10,
      "label": "Cross Site Tracing",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/107.html",
      "id": "CAPEC-107"
    },
    {
      "Description": "<b>CAPEC-226: Session Credential Falsification through Manipulation</b><br>An attacker manipulates an existing credential in order to gain access to a target application. Session credentials allow users to identify themselves to a service after an initial authentication without needing to resend the authentication information (usually a username and password) with every message. An attacker may be able to manipulate a credential sniffed from an existing connection in order to gain access to a target server.",
      "color": "#94ebff",
      "size": 10,
      "label": "Session Credential Falsification through Manipulation",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/226.html",
      "id": "CAPEC-226"
    },
    {
      "Description": "<b>CAPEC-196: Session Credential Falsification through Forging</b><br>An attacker creates a false but functional session credential in order to gain or usurp access to a service. Session credentials allow users to identify themselves to a service after an initial authentication without needing to resend the authentication information (usually a username and password) with every message. If an attacker is able to forge valid session credentials they may be able to bypass authentication or piggy-back off some other authenticated user's session. This attack differs from Reuse of Session IDs and Session Sidejacking attacks in that in the latter attacks an attacker uses a previous or existing credential without modification while, in a forging attack, the attacker must create their own credential, although it may be based on previously observed credentials.",
      "color": "#75aaff",
      "size": 18,
      "label": "Session Credential Falsification through Forging",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/196.html",
      "id": "CAPEC-196"
    },
    {
      "Description": "<b>CAPEC-593: Session Hijacking</b><br>This type of attack involves an adversary that exploits weaknesses in an application's use of sessions in performing authentication. The adversary is able to steal or manipulate an active session and use it to gain unathorized access to the application.",
      "color": "#75aaff",
      "size": 18,
      "label": "Session Hijacking",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/593.html",
      "id": "CAPEC-593"
    },
    {
      "Description": "<b>CAPEC-21: Exploitation of Trusted Identifiers</b><br>An adversary guesses, obtains, or \"rides\" a trusted identifier (e.g. session ID, resource ID, cookie, etc.) to perform authorized actions under the guise of an authenticated user or service.",
      "color": "#2176ff",
      "size": 30,
      "label": "Exploitation of Trusted Identifiers",
      "label_class": "node-label-big",
      "type": "CAPEC",
      "abstraction": "Meta",
      "url": "https://capec.mitre.org/data/definitions/21.html",
      "id": "CAPEC-21"
    },
    {
      "Description": "<b>CAPEC-61: Session Fixation</b><br>The attacker induces a client to establish a session with the target software using a session identifier provided by the attacker. Once the user successfully authenticates to the target software, the attacker uses the (now privileged) session identifier in their own transactions. This attack leverages the fact that the target software either relies on client-generated session identifiers or maintains the same session identifiers after privilege elevation.",
      "color": "#94ebff",
      "size": 10,
      "label": "Session Fixation",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/61.html",
      "id": "CAPEC-61"
    }
  ],
  "links": [
    {
      "source": "CAPEC-102",
      "target": "CAPEC-593"
    },
    {
      "source": "CAPEC-60",
      "target": "CAPEC-593"
    },
    {
      "source": "CAPEC-467",
      "target": "CAPEC-62"
    },
    {
      "source": "CAPEC-59",
      "target": "CAPEC-196"
    },
    {
      "source": "CAPEC-510",
      "target": "CAPEC-21"
    },
    {
      "source": "CAPEC-62",
      "target": "CAPEC-21"
    },
    {
      "source": "CAPEC-107",
      "target": "CAPEC-593"
    },
    {
      "source": "CAPEC-226",
      "target": "CAPEC-196"
    },
    {
      "source": "CAPEC-196",
      "target": "CAPEC-21"
    },
    {
      "source": "CAPEC-593",
      "target": "CAPEC-21"
    },
    {
      "source": "CAPEC-61",
      "target": "CAPEC-593"
    }
  ]
}