{
  "directed": true,
  "multigraph": false,
  "graph": {},
  "nodes": [
    {
      "Description": "<b>CAPEC-24: Filter Failure through Buffer Overflow</b><br>In this attack, the idea is to cause an active filter to fail by causing an oversized transaction. An attacker may try to feed overly long input strings to the program in an attempt to overwhelm the filter (by causing a buffer overflow) and hoping that the filter does not fail securely (i.e. the user input is let into the system unfiltered).",
      "color": "#94ebff",
      "size": 10,
      "label": "Filter Failure through Buffer Overflow",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/24.html",
      "id": "CAPEC-24"
    },
    {
      "Description": "<b>CAPEC-10: Buffer Overflow via Environment Variables</b><br>This attack pattern involves causing a buffer overflow through manipulation of environment variables. Once the adversary finds that they can modify an environment variable, they may try to overflow associated buffers. This attack leverages implicit trust often placed in environment variables.",
      "color": "#94ebff",
      "size": 10,
      "label": "Buffer Overflow via Environment Variables",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/10.html",
      "id": "CAPEC-10"
    },
    {
      "Description": "<b>CAPEC-9: Buffer Overflow in Local Command-Line Utilities</b><br>This attack targets command-line utilities available in a number of shells. An adversary can leverage a vulnerability found in a command-line utility to escalate privilege to root.",
      "color": "#94ebff",
      "size": 10,
      "label": "Buffer Overflow in Local Command-Line Utilities",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/9.html",
      "id": "CAPEC-9"
    },
    {
      "Description": "<b>CAPEC-100: Overflow Buffers</b><br>Buffer Overflow attacks target improper or missing bounds checking on buffer operations, typically triggered by input injected by an adversary. As a consequence, an adversary is able to write past the boundaries of allocated buffer regions in memory, causing a program crash or potentially redirection of execution as per the adversaries' choice.",
      "color": "#75aaff",
      "size": 18,
      "label": "Overflow Buffers",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/100.html",
      "id": "CAPEC-100"
    },
    {
      "Description": "<b>CAPEC-540: Overread Buffers</b><br>An adversary attacks a target by providing input that causes an application to read beyond the boundary of a defined buffer. This typically occurs when a value influencing where to start or stop reading is set to reflect positions outside of the valid memory location of the buffer. This type of attack may result in exposure of sensitive information, a system crash, or arbitrary code execution.",
      "color": "#75aaff",
      "size": 18,
      "label": "Overread Buffers",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/540.html",
      "id": "CAPEC-540"
    },
    {
      "Description": "<b>CAPEC-256: SOAP Array Overflow</b><br>An attacker sends a SOAP request with an array whose actual length exceeds the length indicated in the request. If the server processing the transmission naively trusts the specified size, then an attacker can intentionally understate the size of the array, possibly resulting in a buffer overflow if the server attempts to read the entire data set into the memory it allocated for a smaller array.",
      "color": "#94ebff",
      "size": 10,
      "label": "SOAP Array Overflow",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/256.html",
      "id": "CAPEC-256"
    },
    {
      "Description": "<b>CAPEC-14: Client-side Injection-induced Buffer Overflow</b><br>This type of attack exploits a buffer overflow vulnerability in targeted client software through injection of malicious content from a custom-built hostile service. This hostile service is created to deliver the correct content to the client software. For example, if the client-side application is a browser, the service will host a webpage that the browser loads.",
      "color": "#94ebff",
      "size": 10,
      "label": "Client-side Injection-induced Buffer Overflow",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/14.html",
      "id": "CAPEC-14"
    },
    {
      "Description": "<b>CAPEC-45: Buffer Overflow via Symbolic Links</b><br>This type of attack leverages the use of symbolic links to cause buffer overflows. An adversary can try to create or manipulate a symbolic link file such that its contents result in out of bounds data. When the target software processes the symbolic link file, it could potentially overflow internal buffers with insufficient bounds checking.",
      "color": "#94ebff",
      "size": 10,
      "label": "Buffer Overflow via Symbolic Links",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/45.html",
      "id": "CAPEC-45"
    },
    {
      "Description": "<b>CAPEC-123: Buffer Manipulation</b><br>An adversary manipulates an application's interaction with a buffer in an attempt to read or modify data they shouldn't have access to. Buffer attacks are distinguished in that it is the buffer space itself that is the target of the attack rather than any code responsible for interpreting the content of the buffer. In virtually all buffer attacks the content that is placed in the buffer is immaterial. Instead, most buffer attacks involve retrieving or providing more input than can be stored in the allocated buffer, resulting in the reading or overwriting of other unintended program memory.",
      "color": "#2176ff",
      "size": 30,
      "label": "Buffer Manipulation",
      "label_class": "node-label-big",
      "type": "CAPEC",
      "abstraction": "Meta",
      "url": "https://capec.mitre.org/data/definitions/123.html",
      "id": "CAPEC-123"
    },
    {
      "Description": "<b>CAPEC-46: Overflow Variables and Tags</b><br>This type of attack leverages the use of tags or variables from a formatted configuration data to cause buffer overflow. The adversary crafts a malicious HTML page or configuration file that includes oversized strings, thus causing an overflow.",
      "color": "#94ebff",
      "size": 10,
      "label": "Overflow Variables and Tags",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/46.html",
      "id": "CAPEC-46"
    },
    {
      "Description": "<b>CAPEC-8: Buffer Overflow in an API Call</b><br>This attack targets libraries or shared code modules which are vulnerable to buffer overflow attacks. An adversary who has knowledge of known vulnerable libraries or shared code can easily target software that makes use of these libraries. All clients that make use of the code library thus become vulnerable by association. This has a very broad effect on security across a system, usually affecting more than one software process.",
      "color": "#94ebff",
      "size": 10,
      "label": "Buffer Overflow in an API Call",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/8.html",
      "id": "CAPEC-8"
    },
    {
      "Description": "<b>CAPEC-67: String Format Overflow in syslog()</b><br>This attack targets applications and software that uses the syslog() function insecurely. If an application does not explicitely use a format string parameter in a call to syslog(), user input can be placed in the format string parameter leading to a format string injection attack. Adversaries can then inject malicious format string commands into the function call leading to a buffer overflow. There are many reported software vulnerabilities with the root cause being a misuse of the syslog() function.",
      "color": "#94ebff",
      "size": 10,
      "label": "String Format Overflow in syslog()",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/67.html",
      "id": "CAPEC-67"
    },
    {
      "Description": "<b>CAPEC-42: MIME Conversion</b><br>An attacker exploits a weakness in the MIME conversion routine to cause a buffer overflow and gain control over the mail server machine. The MIME system is designed to allow various different information formats to be interpreted and sent via e-mail. Attack points exist when data are converted to MIME compatible format and back.",
      "color": "#94ebff",
      "size": 10,
      "label": "MIME Conversion",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/42.html",
      "id": "CAPEC-42"
    },
    {
      "Description": "<b>CAPEC-47: Buffer Overflow via Parameter Expansion</b><br>In this attack, the target software is given input that the adversary knows will be modified and expanded in size during processing. This attack relies on the target software failing to anticipate that the expanded data may exceed some internal limit, thereby creating a buffer overflow.",
      "color": "#94ebff",
      "size": 10,
      "label": "Buffer Overflow via Parameter Expansion",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/47.html",
      "id": "CAPEC-47"
    },
    {
      "Description": "<b>CAPEC-44: Overflow Binary Resource File</b><br>An attack of this type exploits a buffer overflow vulnerability in the handling of binary resources. Binary resources may include music files like MP3, image files like JPEG files, and any other binary file. These attacks may pass unnoticed to the client machine through normal usage of files, such as a browser loading a seemingly innocent JPEG file. This can allow the adversary access to the execution stack and execute arbitrary code in the target process.",
      "color": "#94ebff",
      "size": 10,
      "label": "Overflow Binary Resource File",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/44.html",
      "id": "CAPEC-44"
    }
  ],
  "links": [
    {
      "source": "CAPEC-24",
      "target": "CAPEC-100"
    },
    {
      "source": "CAPEC-10",
      "target": "CAPEC-100"
    },
    {
      "source": "CAPEC-9",
      "target": "CAPEC-100"
    },
    {
      "source": "CAPEC-100",
      "target": "CAPEC-123"
    },
    {
      "source": "CAPEC-540",
      "target": "CAPEC-123"
    },
    {
      "source": "CAPEC-256",
      "target": "CAPEC-100"
    },
    {
      "source": "CAPEC-14",
      "target": "CAPEC-100"
    },
    {
      "source": "CAPEC-45",
      "target": "CAPEC-100"
    },
    {
      "source": "CAPEC-46",
      "target": "CAPEC-100"
    },
    {
      "source": "CAPEC-8",
      "target": "CAPEC-100"
    },
    {
      "source": "CAPEC-67",
      "target": "CAPEC-100"
    },
    {
      "source": "CAPEC-42",
      "target": "CAPEC-100"
    },
    {
      "source": "CAPEC-47",
      "target": "CAPEC-100"
    },
    {
      "source": "CAPEC-44",
      "target": "CAPEC-100"
    }
  ]
}