{
  "directed": true,
  "multigraph": false,
  "graph": {},
  "nodes": [
    {
      "Description": "<b>CAPEC-482: TCP Flood</b><br>An adversary may execute a flooding attack using the TCP protocol with the intent to deny legitimate users access to a service. These attacks exploit the weakness within the TCP protocol where there is some state information for the connection the server needs to maintain. This often involves the use of TCP SYN messages.",
      "color": "#75aaff",
      "size": 18,
      "label": "TCP Flood",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/482.html",
      "id": "CAPEC-482"
    },
    {
      "Description": "<b>CAPEC-490: Amplification</b><br>An adversary may execute an amplification where the size of a response is far greater than that of the request that generates it. The goal of this attack is to use a relatively few resources to create a large amount of traffic against a target server. To execute this attack, an adversary send a request to a 3rd party service, spoofing the source address to be that of the target server. The larger response that is generated by the 3rd party service is then sent to the target server. By sending a large number of initial requests, the adversary can generate a tremendous amount of traffic directed at the target. The greater the discrepancy in size between the initial request and the final payload delivered to the target increased the effectiveness of this attack.",
      "color": "#75aaff",
      "size": 18,
      "label": "Amplification",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/490.html",
      "id": "CAPEC-490"
    },
    {
      "Description": "<b>CAPEC-666: BlueSmacking</b><br>An adversary uses Bluetooth flooding to transfer large packets to Bluetooth enabled devices over the L2CAP protocol with the goal of creating a DoS. This attack must be carried out within close proximity to a Bluetooth enabled device.",
      "color": "#75aaff",
      "size": 18,
      "label": "BlueSmacking",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/666.html",
      "id": "CAPEC-666"
    },
    {
      "Description": "<b>CAPEC-147: XML Ping of the Death</b><br>An attacker initiates a resource depletion attack where a large number of small XML messages are delivered at a sufficiently rapid rate to cause a denial of service or crash of the target. Transactions such as repetitive SOAP transactions can deplete resources faster than a simple flooding attack because of the additional resources used by the SOAP protocol and the resources necessary to process SOAP messages. The transactions used are immaterial as long as they cause resource utilization on the target. In other words, this is a normal flooding attack augmented by using messages that will require extra processing on the target.",
      "color": "#94ebff",
      "size": 10,
      "label": "XML Ping of the Death",
      "label_class": "node-label-small",
      "type": "CAPEC",
      "abstraction": "Detailed",
      "url": "https://capec.mitre.org/data/definitions/147.html",
      "id": "CAPEC-147"
    },
    {
      "Description": "<b>CAPEC-489: SSL Flood</b><br>An adversary may execute a flooding attack using the SSL protocol with the intent to deny legitimate users access to a service by consuming all the available resources on the server side. These attacks take advantage of the asymmetric relationship between the processing power used by the client and the processing power used by the server to create a secure connection. In this manner the attacker can make a large number of HTTPS requests on a low provisioned machine to tie up a disproportionately large number of resources on the server. The clients then continue to keep renegotiating the SSL connection. When multiplied by a large number of attacking machines, this attack can result in a crash or loss of service to legitimate users.",
      "color": "#75aaff",
      "size": 18,
      "label": "SSL Flood",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/489.html",
      "id": "CAPEC-489"
    },
    {
      "Description": "<b>CAPEC-488: HTTP Flood</b><br>An adversary may execute a flooding attack using the HTTP protocol with the intent to deny legitimate users access to a service by consuming resources at the application layer such as web services and their infrastructure. These attacks use legitimate session-based HTTP GET requests designed to consume large amounts of a server's resources. Since these are legitimate sessions this attack is very difficult to detect.",
      "color": "#75aaff",
      "size": 18,
      "label": "HTTP Flood",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/488.html",
      "id": "CAPEC-488"
    },
    {
      "Description": "<b>CAPEC-487: ICMP Flood</b><br>An adversary may execute a flooding attack using the ICMP protocol with the intent to deny legitimate users access to a service by consuming the available network bandwidth. A typical attack involves a victim server receiving ICMP packets at a high rate from a wide range of source addresses. Additionally, due to the session-less nature of the ICMP protocol, the source of a packet is easily spoofed making it difficult to find the source of the attack.",
      "color": "#75aaff",
      "size": 18,
      "label": "ICMP Flood",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/487.html",
      "id": "CAPEC-487"
    },
    {
      "Description": "<b>CAPEC-125: Flooding</b><br>An adversary consumes the resources of a target by rapidly engaging in a large number of interactions with the target. This type of attack generally exposes a weakness in rate limiting or flow. When successful this attack prevents legitimate users from accessing the service and can cause the target to crash. This attack differs from resource depletion through leaks or allocations in that the latter attacks do not rely on the volume of requests made to the target but instead focus on manipulation of the target's operations. The key factor in a flooding attack is the number of requests the adversary can make in a given period of time. The greater this number, the more likely an attack is to succeed against a given target.",
      "color": "#2176ff",
      "size": 30,
      "label": "Flooding",
      "label_class": "node-label-big",
      "type": "CAPEC",
      "abstraction": "Meta",
      "url": "https://capec.mitre.org/data/definitions/125.html",
      "id": "CAPEC-125"
    },
    {
      "Description": "<b>CAPEC-528: XML Flood</b><br>An adversary may execute a flooding attack using XML messages with the intent to deny legitimate users access to a web service. These attacks are accomplished by sending a large number of XML based requests and letting the service attempt to parse each one. In many cases this type of an attack will result in a XML Denial of Service (XDoS) due to an application becoming unstable, freezing, or crashing.",
      "color": "#75aaff",
      "size": 18,
      "label": "XML Flood",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/528.html",
      "id": "CAPEC-528"
    },
    {
      "Description": "<b>CAPEC-486: UDP Flood</b><br>An adversary may execute a flooding attack using the UDP protocol with the intent to deny legitimate users access to a service by consuming the available network bandwidth. Additionally, firewalls often open a port for each UDP connection destined for a service with an open UDP port, meaning the firewalls in essence save the connection state thus the high packet nature of a UDP flood can also overwhelm resources allocated to the firewall. UDP attacks can also target services like DNS or VoIP which utilize these protocols. Additionally, due to the session-less nature of the UDP protocol, the source of a packet is easily spoofed making it difficult to find the source of the attack.",
      "color": "#75aaff",
      "size": 18,
      "label": "UDP Flood",
      "label_class": "node-label-medium",
      "type": "CAPEC",
      "abstraction": "Standard",
      "url": "https://capec.mitre.org/data/definitions/486.html",
      "id": "CAPEC-486"
    }
  ],
  "links": [
    {
      "source": "CAPEC-482",
      "target": "CAPEC-125"
    },
    {
      "source": "CAPEC-490",
      "target": "CAPEC-125"
    },
    {
      "source": "CAPEC-666",
      "target": "CAPEC-125"
    },
    {
      "source": "CAPEC-147",
      "target": "CAPEC-528"
    },
    {
      "source": "CAPEC-489",
      "target": "CAPEC-125"
    },
    {
      "source": "CAPEC-488",
      "target": "CAPEC-125"
    },
    {
      "source": "CAPEC-487",
      "target": "CAPEC-125"
    },
    {
      "source": "CAPEC-528",
      "target": "CAPEC-125"
    },
    {
      "source": "CAPEC-486",
      "target": "CAPEC-125"
    }
  ]
}