{
  "directed": true,
  "multigraph": false,
  "graph": {},
  "nodes": [
    {
      "Description": "<b>CWE-204: Observable Response Discrepancy</b><br>The product provides different responses to incoming requests in a way that reveals internal state information to an unauthorized actor outside of the intended control sphere.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Observable Response Discrepancy",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/204.html",
      "id": "CWE-204"
    },
    {
      "Description": "<b>CWE-538: Insertion of Sensitive Information into Externally-Accessible File or Directory</b><br>The product places sensitive information into files or directories that are accessible to actors who are allowed to have access to the files, but not to the sensitive information.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Insertion of Sensitive Information into Externally-Accessible File or Directory",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/538.html",
      "id": "CWE-538"
    },
    {
      "Description": "<b>CWE-540: Inclusion of Sensitive Information in Source Code</b><br>Source code on a web server or repository often contains sensitive information and should generally not be accessible to users.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Inclusion of Sensitive Information in Source Code",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/540.html",
      "id": "CWE-540"
    },
    {
      "Description": "<b>CWE-537: Java Runtime Error Message Containing Sensitive Information</b><br>In many cases, an attacker can leverage the conditions that cause unhandled exception errors in order to gain unauthorized access to the system.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Java Runtime Error Message Containing Sensitive Information",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/537.html",
      "id": "CWE-537"
    },
    {
      "Description": "<b>CWE-497: Exposure of Sensitive System Information to an Unauthorized Control Sphere</b><br>The product does not properly prevent sensitive system-level information from being accessed by unauthorized actors who do not have the same level of access to the underlying system as the product does.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Exposure of Sensitive System Information to an Unauthorized Control Sphere",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/497.html",
      "id": "CWE-497"
    },
    {
      "Description": "<b>CWE-214: Invocation of Process Using Visible Sensitive Information</b><br>A process is invoked with sensitive command-line arguments, environment variables, or other elements that can be seen by other processes on the operating system.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Invocation of Process Using Visible Sensitive Information",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/214.html",
      "id": "CWE-214"
    },
    {
      "Description": "<b>CWE-1273: Device Unlock Credential Sharing</b><br>The credentials necessary for unlocking a device are shared across multiple parties and may expose sensitive information.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Device Unlock Credential Sharing",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/1273.html",
      "id": "CWE-1273"
    },
    {
      "Description": "<b>CWE-215: Insertion of Sensitive Information Into Debugging Code</b><br>The product inserts sensitive information into debugging code, which could expose this information if the debugging code is not disabled in production.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Insertion of Sensitive Information Into Debugging Code",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/215.html",
      "id": "CWE-215"
    },
    {
      "Description": "<b>CWE-206: Observable Internal Behavioral Discrepancy</b><br>The product performs multiple behaviors that are combined to produce a single result, but the individual behaviors are observable separately in a way that allows attackers to reveal internal state or internal decision points.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Observable Internal Behavioral Discrepancy",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/206.html",
      "id": "CWE-206"
    },
    {
      "Description": "<b>CWE-207: Observable Behavioral Discrepancy With Equivalent Products</b><br>The product operates in an environment in which its existence or specific identity should not be known, but it behaves differently than other products with equivalent functionality, in a way that is observable to an attacker.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Observable Behavioral Discrepancy With Equivalent Products",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/207.html",
      "id": "CWE-207"
    },
    {
      "Description": "<b>CWE-205: Observable Behavioral Discrepancy</b><br>The product's behaviors indicate important differences that may be observed by unauthorized actors in a way that reveals (1) its internal state or decision process, or (2) differences from other products with equivalent functionality.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Observable Behavioral Discrepancy",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/205.html",
      "id": "CWE-205"
    },
    {
      "Description": "<b>CWE-201: Insertion of Sensitive Information Into Sent Data</b><br>The code transmits data to another actor, but a portion of the data includes sensitive information that should not be accessible to that actor.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Insertion of Sensitive Information Into Sent Data",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/201.html",
      "id": "CWE-201"
    },
    {
      "Description": "<b>CWE-213: Exposure of Sensitive Information Due to Incompatible Policies</b><br>The product's intended functionality exposes information to certain actors in accordance with the developer's security policy, but this information is regarded as sensitive according to the intended security policies of other stakeholders such as the product's administrator, users, or others whose information is being processed.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Exposure of Sensitive Information Due to Incompatible Policies",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/213.html",
      "id": "CWE-213"
    },
    {
      "Description": "<b>CWE-548: Exposure of Information Through Directory Listing</b><br>A directory listing is inappropriately exposed, yielding potentially sensitive information to attackers.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Exposure of Information Through Directory Listing",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/548.html",
      "id": "CWE-548"
    },
    {
      "Description": "<b>CWE-531: Inclusion of Sensitive Information in Test Code</b><br>Accessible test applications can pose a variety of security risks. Since developers or administrators rarely consider that someone besides themselves would even know about the existence of these applications, it is common for them to contain sensitive information or functions.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Inclusion of Sensitive Information in Test Code",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/531.html",
      "id": "CWE-531"
    },
    {
      "Description": "<b>CWE-541: Inclusion of Sensitive Information in an Include File</b><br>If an include file source is accessible, the file can contain usernames and passwords, as well as sensitive information pertaining to the application and system.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Inclusion of Sensitive Information in an Include File",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/541.html",
      "id": "CWE-541"
    },
    {
      "Description": "<b>CWE-1258: Exposure of Sensitive System Information Due to Uncleared Debug Information</b><br>The hardware does not fully clear security-sensitive values, such as keys and intermediate values in cryptographic operations, when debug mode is entered.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Exposure of Sensitive System Information Due to Uncleared Debug Information",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/1258.html",
      "id": "CWE-1258"
    },
    {
      "Description": "<b>CWE-203: Observable Discrepancy</b><br>The product behaves differently or sends different responses under different circumstances in a way that is observable to an unauthorized actor, which exposes security-relevant information about the state of the product, such as whether a particular operation was successful or not.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Observable Discrepancy",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/203.html",
      "id": "CWE-203"
    },
    {
      "Description": "<b>CWE-532: Insertion of Sensitive Information into Log File</b><br>Information written to log files can be of a sensitive nature and give valuable guidance to an attacker or expose sensitive user information.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Insertion of Sensitive Information into Log File",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/532.html",
      "id": "CWE-532"
    },
    {
      "Description": "<b>CWE-211: Externally-Generated Error Message Containing Sensitive Information</b><br>The product performs an operation that triggers an external diagnostic or error message that is not directly generated or controlled by the product, such as an error generated by the programming language interpreter that a software application uses. The error can contain sensitive system information.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Externally-Generated Error Message Containing Sensitive Information",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/211.html",
      "id": "CWE-211"
    },
    {
      "Description": "<b>CWE-1254: Incorrect Comparison Logic Granularity</b><br>The product's comparison logic is performed over a series of steps rather than across the entire string in one operation. If there is a comparison logic failure on one of these steps, the operation may be vulnerable to a timing attack that can result in the interception of the process for nefarious purposes.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Incorrect Comparison Logic Granularity",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/1254.html",
      "id": "CWE-1254"
    },
    {
      "Description": "<b>CWE-651: Exposure of WSDL File Containing Sensitive Information</b><br>The Web services architecture may require exposing a Web Service Definition Language (WSDL) file that contains information on the publicly accessible services and how callers of these services should interact with them (e.g. what parameters they expect and what types they return).",
      "color": "#e8e66b",
      "size": 10,
      "label": "Exposure of WSDL File Containing Sensitive Information",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/651.html",
      "id": "CWE-651"
    },
    {
      "Description": "<b>CWE-550: Server-generated Error Message Containing Sensitive Information</b><br>Certain conditions, such as network failure, will cause a server error message to be displayed.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Server-generated Error Message Containing Sensitive Information",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/550.html",
      "id": "CWE-550"
    },
    {
      "Description": "<b>CWE-535: Exposure of Information Through Shell Error Message</b><br>A command shell error message indicates that there exists an unhandled exception in the web application code. In many cases, an attacker can leverage the conditions that cause these errors in order to gain unauthorized access to the system.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Exposure of Information Through Shell Error Message",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/535.html",
      "id": "CWE-535"
    },
    {
      "Description": "<b>CWE-536: Servlet Runtime Error Message Containing Sensitive Information</b><br>A servlet error message indicates that there exists an unhandled exception in your web application code and may provide useful information to an attacker.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Servlet Runtime Error Message Containing Sensitive Information",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/536.html",
      "id": "CWE-536"
    },
    {
      "Description": "<b>CWE-1300: Improper Protection of Physical Side Channels</b><br>The device does not contain sufficient protection\n\tmechanisms to prevent physical side channels from exposing\n\tsensitive information due to patterns in physically observable\n\tphenomena such as variations in power consumption,\n\telectromagnetic emissions (EME), or acoustic emissions.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Improper Protection of Physical Side Channels",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/1300.html",
      "id": "CWE-1300"
    },
    {
      "Description": "<b>CWE-598: Use of GET Request Method With Sensitive Query Strings</b><br>The web application uses the HTTP GET method to process a request and includes sensitive information in the query string of that request.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Use of GET Request Method With Sensitive Query Strings",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/598.html",
      "id": "CWE-598"
    },
    {
      "Description": "<b>CWE-359: Exposure of Private Personal Information to an Unauthorized Actor</b><br>The product does not properly prevent a person's private, personal information from being accessed by actors who either (1) are not explicitly authorized to access the information or (2) do not have the implicit consent of the person about whom the information is collected.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Exposure of Private Personal Information to an Unauthorized Actor",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/359.html",
      "id": "CWE-359"
    },
    {
      "Description": "<b>CWE-1295: Debug Messages Revealing Unnecessary Information</b><br>The product fails to adequately prevent the revealing of unnecessary and potentially sensitive system information within debugging messages.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Debug Messages Revealing Unnecessary Information",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/1295.html",
      "id": "CWE-1295"
    },
    {
      "Description": "<b>CWE-615: Inclusion of Sensitive Information in Source Code Comments</b><br>While adding general comments is very useful, some programmers tend to leave important data, such as: filenames related to the web application, old links or links which were not meant to be browsed by users, old code fragments, etc.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Inclusion of Sensitive Information in Source Code Comments",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/615.html",
      "id": "CWE-615"
    },
    {
      "Description": "<b>CWE-1303: Non-Transparent Sharing of Microarchitectural Resources</b><br>Hardware structures shared across execution contexts (e.g., caches and branch predictors) can violate the expected architecture isolation between contexts.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Non-Transparent Sharing of Microarchitectural Resources",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/1303.html",
      "id": "CWE-1303"
    },
    {
      "Description": "<b>CWE-200: Exposure of Sensitive Information to an Unauthorized Actor</b><br>The product exposes sensitive information to an actor that is not explicitly authorized to have access to that information.",
      "color": "#ff6200",
      "size": 18,
      "label": "Exposure of Sensitive Information to an Unauthorized Actor",
      "label_class": "node-label-medium",
      "type": "CWE",
      "abstraction": "Class",
      "url": "https://cwe.mitre.org/data/definitions/200.html",
      "id": "CWE-200"
    },
    {
      "Description": "<b>CWE-210: Self-generated Error Message Containing Sensitive Information</b><br>The product identifies an error condition and creates its own diagnostic or error messages that contain sensitive information.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Self-generated Error Message Containing Sensitive Information",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/210.html",
      "id": "CWE-210"
    },
    {
      "Description": "<b>CWE-1255: Comparison Logic is Vulnerable to Power Side-Channel Attacks</b><br>A device's real time power consumption may be monitored during security token evaluation and the information gleaned may be used to determine the value of the reference token.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Comparison Logic is Vulnerable to Power Side-Channel Attacks",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/1255.html",
      "id": "CWE-1255"
    },
    {
      "Description": "<b>CWE-209: Generation of Error Message Containing Sensitive Information</b><br>The product generates an error message that includes sensitive information about its environment, users, or associated data.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Generation of Error Message Containing Sensitive Information",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/209.html",
      "id": "CWE-209"
    },
    {
      "Description": "<b>CWE-208: Observable Timing Discrepancy</b><br>Two separate operations in a product require different amounts of time to complete, in a way that is observable to an actor and reveals security-relevant information about the state of the product, such as whether a particular operation was successful or not.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Observable Timing Discrepancy",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/208.html",
      "id": "CWE-208"
    }
  ],
  "links": [
    {
      "width": 1,
      "source": "CWE-204",
      "target": "CWE-203"
    },
    {
      "width": 1,
      "source": "CWE-538",
      "target": "CWE-200"
    },
    {
      "width": 1,
      "source": "CWE-540",
      "target": "CWE-538"
    },
    {
      "width": 1,
      "source": "CWE-537",
      "target": "CWE-211"
    },
    {
      "width": 1,
      "source": "CWE-497",
      "target": "CWE-200"
    },
    {
      "width": 1,
      "source": "CWE-214",
      "target": "CWE-497"
    },
    {
      "width": 1,
      "source": "CWE-1273",
      "target": "CWE-200"
    },
    {
      "width": 1,
      "source": "CWE-215",
      "target": "CWE-200"
    },
    {
      "width": 1,
      "source": "CWE-206",
      "target": "CWE-205"
    },
    {
      "width": 1,
      "source": "CWE-207",
      "target": "CWE-205"
    },
    {
      "width": 1,
      "source": "CWE-205",
      "target": "CWE-203"
    },
    {
      "width": 1,
      "source": "CWE-201",
      "target": "CWE-200"
    },
    {
      "width": 1,
      "source": "CWE-213",
      "target": "CWE-200"
    },
    {
      "width": 1,
      "source": "CWE-548",
      "target": "CWE-497"
    },
    {
      "width": 1,
      "source": "CWE-531",
      "target": "CWE-540"
    },
    {
      "width": 1,
      "source": "CWE-541",
      "target": "CWE-540"
    },
    {
      "width": 1,
      "source": "CWE-1258",
      "target": "CWE-200"
    },
    {
      "width": 1,
      "source": "CWE-203",
      "target": "CWE-200"
    },
    {
      "width": 1,
      "source": "CWE-532",
      "target": "CWE-538"
    },
    {
      "width": 1,
      "source": "CWE-532",
      "target": "CWE-200"
    },
    {
      "width": 1,
      "source": "CWE-211",
      "target": "CWE-209"
    },
    {
      "width": 1,
      "source": "CWE-1254",
      "target": "CWE-208"
    },
    {
      "width": 1,
      "source": "CWE-651",
      "target": "CWE-538"
    },
    {
      "width": 1,
      "source": "CWE-550",
      "target": "CWE-209"
    },
    {
      "width": 1,
      "source": "CWE-535",
      "target": "CWE-211"
    },
    {
      "width": 1,
      "source": "CWE-536",
      "target": "CWE-211"
    },
    {
      "width": 1,
      "source": "CWE-1300",
      "target": "CWE-203"
    },
    {
      "width": 1,
      "source": "CWE-598",
      "target": "CWE-201"
    },
    {
      "width": 1,
      "source": "CWE-359",
      "target": "CWE-200"
    },
    {
      "width": 1,
      "source": "CWE-1295",
      "target": "CWE-200"
    },
    {
      "width": 1,
      "source": "CWE-615",
      "target": "CWE-540"
    },
    {
      "width": 1,
      "source": "CWE-1303",
      "target": "CWE-203"
    },
    {
      "width": 1,
      "source": "CWE-210",
      "target": "CWE-209"
    },
    {
      "width": 1,
      "source": "CWE-1255",
      "target": "CWE-1300"
    },
    {
      "width": 1,
      "source": "CWE-209",
      "target": "CWE-200"
    },
    {
      "width": 1,
      "source": "CWE-208",
      "target": "CWE-203"
    }
  ]
}