{
  "directed": true,
  "multigraph": false,
  "graph": {},
  "nodes": [
    {
      "Description": "<b>CWE-85: Doubled Character XSS Manipulations</b><br>The web application does not filter user-controlled input for executable script disguised using doubling of the involved characters.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Doubled Character XSS Manipulations",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/85.html",
      "id": "CWE-85"
    },
    {
      "Description": "<b>CWE-1336: Improper Neutralization of Special Elements Used in a Template Engine</b><br>The product uses a template engine to insert or process externally-influenced input, but it does not neutralize or incorrectly neutralizes special elements or syntax that can be interpreted as template expressions or other code directives when processed by the engine.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Improper Neutralization of Special Elements Used in a Template Engine",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/1336.html",
      "id": "CWE-1336"
    },
    {
      "Description": "<b>CWE-88: Improper Neutralization of Argument Delimiters in a Command ('Argument Injection')</b><br>The product constructs a string for a command to be executed by a separate component\nin another control sphere, but it does not properly delimit the\nintended arguments, options, or switches within that command string.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Improper Neutralization of Argument Delimiters in a Command ('Argument Injection')",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/88.html",
      "id": "CWE-88"
    },
    {
      "Description": "<b>CWE-81: Improper Neutralization of Script in an Error Message Web Page</b><br>The product receives input from an upstream component, but it does not neutralize or incorrectly neutralizes special characters that could be interpreted as web-scripting elements when they are sent to an error page.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Improper Neutralization of Script in an Error Message Web Page",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/81.html",
      "id": "CWE-81"
    },
    {
      "Description": "<b>CWE-80: Improper Neutralization of Script-Related HTML Tags in a Web Page (Basic XSS)</b><br>The product receives input from an upstream component, but it does not neutralize or incorrectly neutralizes special characters such as \"<\", \">\", and \"&\" that could be interpreted as web-scripting elements when they are sent to a downstream component that processes web pages.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Improper Neutralization of Script-Related HTML Tags in a Web Page (Basic XSS)",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/80.html",
      "id": "CWE-80"
    },
    {
      "Description": "<b>CWE-943: Improper Neutralization of Special Elements in Data Query Logic</b><br>The product generates a query intended to access or manipulate data in a data store such as a database, but it does not neutralize or incorrectly neutralizes special elements that can modify the intended logic of the query.",
      "color": "#ff6200",
      "size": 18,
      "label": "Improper Neutralization of Special Elements in Data Query Logic",
      "label_class": "node-label-medium",
      "type": "CWE",
      "abstraction": "Class",
      "url": "https://cwe.mitre.org/data/definitions/943.html",
      "id": "CWE-943"
    },
    {
      "Description": "<b>CWE-917: Improper Neutralization of Special Elements used in an Expression Language Statement ('Expression Language Injection')</b><br>The product constructs all or part of an expression language (EL) statement in a framework such as a Java Server Page (JSP) using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended EL statement before it is executed.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Improper Neutralization of Special Elements used in an Expression Language Statement ('Expression Language Injection')",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/917.html",
      "id": "CWE-917"
    },
    {
      "Description": "<b>CWE-95: Improper Neutralization of Directives in Dynamically Evaluated Code ('Eval Injection')</b><br>The product receives input from an upstream component, but it does not neutralize or incorrectly neutralizes code syntax before using the input in a dynamic evaluation call (e.g. \"eval\").",
      "color": "#e8e66b",
      "size": 10,
      "label": "Improper Neutralization of Directives in Dynamically Evaluated Code ('Eval Injection')",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/95.html",
      "id": "CWE-95"
    },
    {
      "Description": "<b>CWE-96: Improper Neutralization of Directives in Statically Saved Code ('Static Code Injection')</b><br>The product receives input from an upstream component, but it does not neutralize or incorrectly neutralizes code syntax before inserting the input into an executable resource, such as a library, configuration file, or template.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Improper Neutralization of Directives in Statically Saved Code ('Static Code Injection')",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/96.html",
      "id": "CWE-96"
    },
    {
      "Description": "<b>CWE-90: Improper Neutralization of Special Elements used in an LDAP Query ('LDAP Injection')</b><br>The product constructs all or part of an LDAP query using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended LDAP query when it is sent to a downstream component.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Improper Neutralization of Special Elements used in an LDAP Query ('LDAP Injection')",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/90.html",
      "id": "CWE-90"
    },
    {
      "Description": "<b>CWE-75: Failure to Sanitize Special Elements into a Different Plane (Special Element Injection)</b><br>The product does not adequately filter user-controlled input for special elements with control implications.",
      "color": "#ff6200",
      "size": 18,
      "label": "Failure to Sanitize Special Elements into a Different Plane (Special Element Injection)",
      "label_class": "node-label-medium",
      "type": "CWE",
      "abstraction": "Class",
      "url": "https://cwe.mitre.org/data/definitions/75.html",
      "id": "CWE-75"
    },
    {
      "Description": "<b>CWE-86: Improper Neutralization of Invalid Characters in Identifiers in Web Pages</b><br>The product does not neutralize or incorrectly neutralizes invalid characters or byte sequences in the middle of tag names, URI schemes, and other identifiers.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Improper Neutralization of Invalid Characters in Identifiers in Web Pages",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/86.html",
      "id": "CWE-86"
    },
    {
      "Description": "<b>CWE-652: Improper Neutralization of Data within XQuery Expressions ('XQuery Injection')</b><br>The product uses external input to dynamically construct an XQuery expression used to retrieve data from an XML database, but it does not neutralize or incorrectly neutralizes that input. This allows an attacker to control the structure of the query.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Improper Neutralization of Data within XQuery Expressions ('XQuery Injection')",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/652.html",
      "id": "CWE-652"
    },
    {
      "Description": "<b>CWE-624: Executable Regular Expression Error</b><br>The product uses a regular expression that either (1) contains an executable component with user-controlled inputs, or (2) allows a user to enable execution by inserting pattern modifiers.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Executable Regular Expression Error",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/624.html",
      "id": "CWE-624"
    },
    {
      "Description": "<b>CWE-627: Dynamic Variable Evaluation</b><br>In a language where the user can influence the name of a variable at runtime, if the variable names are not controlled, an attacker can read or write to arbitrary variables, or access arbitrary functions.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Dynamic Variable Evaluation",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/627.html",
      "id": "CWE-627"
    },
    {
      "Description": "<b>CWE-99: Improper Control of Resource Identifiers ('Resource Injection')</b><br>The product receives input from an upstream component, but it does not restrict or incorrectly restricts the input before it is used as an identifier for a resource that may be outside the intended sphere of control.",
      "color": "#ff6200",
      "size": 18,
      "label": "Improper Control of Resource Identifiers ('Resource Injection')",
      "label_class": "node-label-medium",
      "type": "CWE",
      "abstraction": "Class",
      "url": "https://cwe.mitre.org/data/definitions/99.html",
      "id": "CWE-99"
    },
    {
      "Description": "<b>CWE-78: Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection')</b><br>The product constructs all or part of an OS command using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended OS command when it is sent to a downstream component.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection')",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/78.html",
      "id": "CWE-78"
    },
    {
      "Description": "<b>CWE-84: Improper Neutralization of Encoded URI Schemes in a Web Page</b><br>The web application improperly neutralizes user-controlled input for executable script disguised with URI encodings.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Improper Neutralization of Encoded URI Schemes in a Web Page",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/84.html",
      "id": "CWE-84"
    },
    {
      "Description": "<b>CWE-74: Improper Neutralization of Special Elements in Output Used by a Downstream Component ('Injection')</b><br>The product constructs all or part of a command, data structure, or record using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify how it is parsed or interpreted when it is sent to a downstream component.",
      "color": "#ff6200",
      "size": 18,
      "label": "Improper Neutralization of Special Elements in Output Used by a Downstream Component ('Injection')",
      "label_class": "node-label-medium",
      "type": "CWE",
      "abstraction": "Class",
      "url": "https://cwe.mitre.org/data/definitions/74.html",
      "id": "CWE-74"
    },
    {
      "Description": "<b>CWE-1236: Improper Neutralization of Formula Elements in a CSV File</b><br>The product saves user-provided information into a Comma-Separated Value (CSV) file, but it does not neutralize or incorrectly neutralizes special elements that could be interpreted as a command when the file is opened by a spreadsheet product.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Improper Neutralization of Formula Elements in a CSV File",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/1236.html",
      "id": "CWE-1236"
    },
    {
      "Description": "<b>CWE-621: Variable Extraction Error</b><br>The product uses external input to determine the names of variables into which information is extracted, without verifying that the names of the specified variables are valid. This could cause the program to overwrite unintended variables.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Variable Extraction Error",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/621.html",
      "id": "CWE-621"
    },
    {
      "Description": "<b>CWE-641: Improper Restriction of Names for Files and Other Resources</b><br>The product constructs the name of a file or other resource using input from an upstream component, but it does not restrict or incorrectly restricts the resulting name.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Improper Restriction of Names for Files and Other Resources",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/641.html",
      "id": "CWE-641"
    },
    {
      "Description": "<b>CWE-102: Struts: Duplicate Validation Forms</b><br>The product uses multiple validation forms with the same name, which might cause the Struts Validator to validate a form that the programmer does not expect.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Struts: Duplicate Validation Forms",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/102.html",
      "id": "CWE-102"
    },
    {
      "Description": "<b>CWE-94: Improper Control of Generation of Code ('Code Injection')</b><br>The product constructs all or part of a code segment using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the syntax or behavior of the intended code segment.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Improper Control of Generation of Code ('Code Injection')",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/94.html",
      "id": "CWE-94"
    },
    {
      "Description": "<b>CWE-89: Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection')</b><br>The product constructs all or part of an SQL command using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended SQL command when it is sent to a downstream component.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection')",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/89.html",
      "id": "CWE-89"
    },
    {
      "Description": "<b>CWE-97: Improper Neutralization of Server-Side Includes (SSI) Within a Web Page</b><br>The product generates a web page, but does not neutralize or incorrectly neutralizes user-controllable input that could be interpreted as a server-side include (SSI) directive.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Improper Neutralization of Server-Side Includes (SSI) Within a Web Page",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/97.html",
      "id": "CWE-97"
    },
    {
      "Description": "<b>CWE-82: Improper Neutralization of Script in Attributes of IMG Tags in a Web Page</b><br>The web application does not neutralize or incorrectly neutralizes scripting elements within attributes of HTML IMG tags, such as the src attribute.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Improper Neutralization of Script in Attributes of IMG Tags in a Web Page",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/82.html",
      "id": "CWE-82"
    },
    {
      "Description": "<b>CWE-83: Improper Neutralization of Script in Attributes in a Web Page</b><br>The product does not neutralize or incorrectly neutralizes \"javascript:\" or other URIs from dangerous attributes within tags, such as onmouseover, onload, onerror, or style.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Improper Neutralization of Script in Attributes in a Web Page",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/83.html",
      "id": "CWE-83"
    },
    {
      "Description": "<b>CWE-564: SQL Injection: Hibernate</b><br>Using Hibernate to execute a dynamic SQL statement built with user-controlled input can allow an attacker to modify the statement's meaning or to execute arbitrary SQL commands.",
      "color": "#e8e66b",
      "size": 10,
      "label": "SQL Injection: Hibernate",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/564.html",
      "id": "CWE-564"
    },
    {
      "Description": "<b>CWE-643: Improper Neutralization of Data within XPath Expressions ('XPath Injection')</b><br>The product uses external input to dynamically construct an XPath expression used to retrieve data from an XML database, but it does not neutralize or incorrectly neutralizes that input. This allows an attacker to control the structure of the query.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Improper Neutralization of Data within XPath Expressions ('XPath Injection')",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/643.html",
      "id": "CWE-643"
    },
    {
      "Description": "<b>CWE-694: Use of Multiple Resources with Duplicate Identifier</b><br>The product uses multiple resources that can have the same identifier, in a context in which unique identifiers are required.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Use of Multiple Resources with Duplicate Identifier",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/694.html",
      "id": "CWE-694"
    },
    {
      "Description": "<b>CWE-914: Improper Control of Dynamically-Identified Variables</b><br>The product does not properly restrict reading from or writing to dynamically-identified variables.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Improper Control of Dynamically-Identified Variables",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/914.html",
      "id": "CWE-914"
    },
    {
      "Description": "<b>CWE-76: Improper Neutralization of Equivalent Special Elements</b><br>The product correctly neutralizes certain special elements, but it improperly neutralizes equivalent special elements.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Improper Neutralization of Equivalent Special Elements",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/76.html",
      "id": "CWE-76"
    },
    {
      "Description": "<b>CWE-93: Improper Neutralization of CRLF Sequences ('CRLF Injection')</b><br>The product uses CRLF (carriage return line feeds) as a special element, e.g. to separate lines or records, but it does not neutralize or incorrectly neutralizes CRLF sequences from inputs.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Improper Neutralization of CRLF Sequences ('CRLF Injection')",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/93.html",
      "id": "CWE-93"
    },
    {
      "Description": "<b>CWE-113: Improper Neutralization of CRLF Sequences in HTTP Headers ('HTTP Request/Response Splitting')</b><br>The product receives data from an HTTP agent/component (e.g., web server, proxy, browser, etc.), but it does not neutralize or incorrectly neutralizes CR and LF characters before the data is included in outgoing HTTP headers.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Improper Neutralization of CRLF Sequences in HTTP Headers ('HTTP Request/Response Splitting')",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/113.html",
      "id": "CWE-113"
    },
    {
      "Description": "<b>CWE-79: Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting')</b><br>The product does not neutralize or incorrectly neutralizes user-controllable input before it is placed in output that is used as a web page that is served to other users.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting')",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/79.html",
      "id": "CWE-79"
    },
    {
      "Description": "<b>CWE-77: Improper Neutralization of Special Elements used in a Command ('Command Injection')</b><br>The product constructs all or part of a command using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended command when it is sent to a downstream component.",
      "color": "#ff6200",
      "size": 18,
      "label": "Improper Neutralization of Special Elements used in a Command ('Command Injection')",
      "label_class": "node-label-medium",
      "type": "CWE",
      "abstraction": "Class",
      "url": "https://cwe.mitre.org/data/definitions/77.html",
      "id": "CWE-77"
    },
    {
      "Description": "<b>CWE-91: XML Injection (aka Blind XPath Injection)</b><br>The product does not properly neutralize special elements that are used in XML, allowing attackers to modify the syntax, content, or commands of the XML before it is processed by an end system.",
      "color": "#ffbb00",
      "size": 10,
      "label": "XML Injection (aka Blind XPath Injection)",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/91.html",
      "id": "CWE-91"
    },
    {
      "Description": "<b>CWE-87: Improper Neutralization of Alternate XSS Syntax</b><br>The product does not neutralize or incorrectly neutralizes user-controlled input for alternate script syntax.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Improper Neutralization of Alternate XSS Syntax",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/87.html",
      "id": "CWE-87"
    },
    {
      "Description": "<b>CWE-462: Duplicate Key in Associative List (Alist)</b><br>Duplicate keys in associative lists can lead to non-unique keys being mistaken for an error.",
      "color": "#e8e66b",
      "size": 10,
      "label": "Duplicate Key in Associative List (Alist)",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/462.html",
      "id": "CWE-462"
    }
  ],
  "links": [
    {
      "width": 1,
      "source": "CWE-85",
      "target": "CWE-79"
    },
    {
      "width": 1,
      "source": "CWE-1336",
      "target": "CWE-94"
    },
    {
      "width": 1,
      "source": "CWE-88",
      "target": "CWE-77"
    },
    {
      "width": 1,
      "source": "CWE-88",
      "target": "CWE-74"
    },
    {
      "width": 1,
      "source": "CWE-81",
      "target": "CWE-79"
    },
    {
      "width": 1,
      "source": "CWE-80",
      "target": "CWE-79"
    },
    {
      "width": 1,
      "source": "CWE-943",
      "target": "CWE-74"
    },
    {
      "width": 1,
      "source": "CWE-917",
      "target": "CWE-77"
    },
    {
      "width": 1,
      "source": "CWE-917",
      "target": "CWE-74"
    },
    {
      "width": 1,
      "source": "CWE-95",
      "target": "CWE-94"
    },
    {
      "width": 1,
      "source": "CWE-96",
      "target": "CWE-94"
    },
    {
      "width": 1,
      "source": "CWE-90",
      "target": "CWE-943"
    },
    {
      "width": 1,
      "source": "CWE-75",
      "target": "CWE-74"
    },
    {
      "width": 1,
      "source": "CWE-86",
      "target": "CWE-79"
    },
    {
      "width": 1,
      "source": "CWE-652",
      "target": "CWE-943"
    },
    {
      "width": 1,
      "source": "CWE-652",
      "target": "CWE-91"
    },
    {
      "width": 1,
      "source": "CWE-624",
      "target": "CWE-77"
    },
    {
      "width": 1,
      "source": "CWE-627",
      "target": "CWE-914"
    },
    {
      "width": 1,
      "source": "CWE-99",
      "target": "CWE-74"
    },
    {
      "width": 1,
      "source": "CWE-78",
      "target": "CWE-77"
    },
    {
      "width": 1,
      "source": "CWE-78",
      "target": "CWE-74"
    },
    {
      "width": 1,
      "source": "CWE-84",
      "target": "CWE-79"
    },
    {
      "width": 1,
      "source": "CWE-1236",
      "target": "CWE-74"
    },
    {
      "width": 1,
      "source": "CWE-621",
      "target": "CWE-914"
    },
    {
      "width": 1,
      "source": "CWE-641",
      "target": "CWE-99"
    },
    {
      "width": 1,
      "source": "CWE-102",
      "target": "CWE-694"
    },
    {
      "width": 1,
      "source": "CWE-94",
      "target": "CWE-74"
    },
    {
      "width": 1,
      "source": "CWE-89",
      "target": "CWE-943"
    },
    {
      "width": 1,
      "source": "CWE-89",
      "target": "CWE-74"
    },
    {
      "width": 1,
      "source": "CWE-97",
      "target": "CWE-96"
    },
    {
      "width": 1,
      "source": "CWE-82",
      "target": "CWE-83"
    },
    {
      "width": 1,
      "source": "CWE-83",
      "target": "CWE-79"
    },
    {
      "width": 1,
      "source": "CWE-564",
      "target": "CWE-89"
    },
    {
      "width": 1,
      "source": "CWE-643",
      "target": "CWE-943"
    },
    {
      "width": 1,
      "source": "CWE-643",
      "target": "CWE-91"
    },
    {
      "width": 1,
      "source": "CWE-694",
      "target": "CWE-99"
    },
    {
      "width": 1,
      "source": "CWE-914",
      "target": "CWE-99"
    },
    {
      "width": 1,
      "source": "CWE-76",
      "target": "CWE-75"
    },
    {
      "width": 1,
      "source": "CWE-93",
      "target": "CWE-74"
    },
    {
      "width": 1,
      "source": "CWE-113",
      "target": "CWE-93"
    },
    {
      "width": 1,
      "source": "CWE-79",
      "target": "CWE-74"
    },
    {
      "width": 1,
      "source": "CWE-77",
      "target": "CWE-74"
    },
    {
      "width": 1,
      "source": "CWE-91",
      "target": "CWE-74"
    },
    {
      "width": 1,
      "source": "CWE-87",
      "target": "CWE-79"
    },
    {
      "width": 1,
      "source": "CWE-462",
      "target": "CWE-694"
    }
  ]
}