{
  "directed": true,
  "multigraph": false,
  "graph": {},
  "nodes": [
    {
      "Description": "<b>CWE-624: Executable Regular Expression Error</b><br>The product uses a regular expression that either (1) contains an executable component with user-controlled inputs, or (2) allows a user to enable execution by inserting pattern modifiers.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Executable Regular Expression Error",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/624.html",
      "id": "CWE-624"
    },
    {
      "Description": "<b>CWE-88: Improper Neutralization of Argument Delimiters in a Command ('Argument Injection')</b><br>The product constructs a string for a command to be executed by a separate component\nin another control sphere, but it does not properly delimit the\nintended arguments, options, or switches within that command string.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Improper Neutralization of Argument Delimiters in a Command ('Argument Injection')",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/88.html",
      "id": "CWE-88"
    },
    {
      "Description": "<b>CWE-917: Improper Neutralization of Special Elements used in an Expression Language Statement ('Expression Language Injection')</b><br>The product constructs all or part of an expression language (EL) statement in a framework such as a Java Server Page (JSP) using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended EL statement before it is executed.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Improper Neutralization of Special Elements used in an Expression Language Statement ('Expression Language Injection')",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/917.html",
      "id": "CWE-917"
    },
    {
      "Description": "<b>CWE-78: Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection')</b><br>The product constructs all or part of an OS command using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended OS command when it is sent to a downstream component.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection')",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/78.html",
      "id": "CWE-78"
    },
    {
      "Description": "<b>CWE-77: Improper Neutralization of Special Elements used in a Command ('Command Injection')</b><br>The product constructs all or part of a command using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended command when it is sent to a downstream component.",
      "color": "#ff6200",
      "size": 18,
      "label": "Improper Neutralization of Special Elements used in a Command ('Command Injection')",
      "label_class": "node-label-medium",
      "type": "CWE",
      "abstraction": "Class",
      "url": "https://cwe.mitre.org/data/definitions/77.html",
      "id": "CWE-77"
    }
  ],
  "links": [
    {
      "width": 1,
      "source": "CWE-624",
      "target": "CWE-77"
    },
    {
      "width": 1,
      "source": "CWE-88",
      "target": "CWE-77"
    },
    {
      "width": 1,
      "source": "CWE-917",
      "target": "CWE-77"
    },
    {
      "width": 1,
      "source": "CWE-78",
      "target": "CWE-77"
    }
  ]
}