{
  "directed": true,
  "multigraph": false,
  "graph": {},
  "nodes": [
    {
      "Description": "<b>CWE-89: Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection')</b><br>The product constructs all or part of an SQL command using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended SQL command when it is sent to a downstream component.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection')",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/89.html",
      "id": "CWE-89"
    },
    {
      "Description": "<b>CWE-943: Improper Neutralization of Special Elements in Data Query Logic</b><br>The product generates a query intended to access or manipulate data in a data store such as a database, but it does not neutralize or incorrectly neutralizes special elements that can modify the intended logic of the query.",
      "color": "#ff6200",
      "size": 18,
      "label": "Improper Neutralization of Special Elements in Data Query Logic",
      "label_class": "node-label-medium",
      "type": "CWE",
      "abstraction": "Class",
      "url": "https://cwe.mitre.org/data/definitions/943.html",
      "id": "CWE-943"
    },
    {
      "Description": "<b>CWE-643: Improper Neutralization of Data within XPath Expressions ('XPath Injection')</b><br>The product uses external input to dynamically construct an XPath expression used to retrieve data from an XML database, but it does not neutralize or incorrectly neutralizes that input. This allows an attacker to control the structure of the query.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Improper Neutralization of Data within XPath Expressions ('XPath Injection')",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/643.html",
      "id": "CWE-643"
    },
    {
      "Description": "<b>CWE-564: SQL Injection: Hibernate</b><br>Using Hibernate to execute a dynamic SQL statement built with user-controlled input can allow an attacker to modify the statement's meaning or to execute arbitrary SQL commands.",
      "color": "#e8e66b",
      "size": 10,
      "label": "SQL Injection: Hibernate",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Variant",
      "url": "https://cwe.mitre.org/data/definitions/564.html",
      "id": "CWE-564"
    },
    {
      "Description": "<b>CWE-90: Improper Neutralization of Special Elements used in an LDAP Query ('LDAP Injection')</b><br>The product constructs all or part of an LDAP query using externally-influenced input from an upstream component, but it does not neutralize or incorrectly neutralizes special elements that could modify the intended LDAP query when it is sent to a downstream component.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Improper Neutralization of Special Elements used in an LDAP Query ('LDAP Injection')",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/90.html",
      "id": "CWE-90"
    },
    {
      "Description": "<b>CWE-652: Improper Neutralization of Data within XQuery Expressions ('XQuery Injection')</b><br>The product uses external input to dynamically construct an XQuery expression used to retrieve data from an XML database, but it does not neutralize or incorrectly neutralizes that input. This allows an attacker to control the structure of the query.",
      "color": "#ffbb00",
      "size": 10,
      "label": "Improper Neutralization of Data within XQuery Expressions ('XQuery Injection')",
      "label_class": "node-label-small",
      "type": "CWE",
      "abstraction": "Base",
      "url": "https://cwe.mitre.org/data/definitions/652.html",
      "id": "CWE-652"
    }
  ],
  "links": [
    {
      "width": 1,
      "source": "CWE-89",
      "target": "CWE-943"
    },
    {
      "width": 1,
      "source": "CWE-643",
      "target": "CWE-943"
    },
    {
      "width": 1,
      "source": "CWE-564",
      "target": "CWE-89"
    },
    {
      "width": 1,
      "source": "CWE-90",
      "target": "CWE-943"
    },
    {
      "width": 1,
      "source": "CWE-652",
      "target": "CWE-943"
    }
  ]
}